# DesignOptionId Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..DesignOptionId Property
ParameterTypeId Class See Also
---
"Design Option"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId DesignOptionId { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property DesignOptionId As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ DesignOptionId {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace